In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os

### Load all Csv files into memory

In [3]:
path=os.listdir('Sales_Data/')

In [4]:
files=[file for file in path]

In [5]:
print(files,len(files))

['Sales_April_2019.csv', 'Sales_August_2019.csv', 'Sales_December_2019.csv', 'Sales_February_2019.csv', 'Sales_January_2019.csv', 'Sales_July_2019.csv', 'Sales_June_2019.csv', 'Sales_March_2019.csv', 'Sales_May_2019.csv', 'Sales_November_2019.csv', 'Sales_October_2019.csv', 'Sales_September_2019.csv'] 12

##### Merge 12 csv files into a singlw dataframe

In [6]:
data=pd.DataFrame()

for i in files:
    df=pd.read_csv('Sales_Data/'+i)
    data=pd.concat([data,df])

In [7]:
data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [8]:
data.shape

(186850, 6)

## Clean up the data

##### Drop rows of NaN

In [9]:
na_data=data[data.isna().any(axis=1)]

In [10]:
na_data.head()

     Order ID Product Quantity Ordered Price Each Order Date Purchase Address
1         NaN     NaN              NaN        NaN        NaN              NaN
356       NaN     NaN              NaN        NaN        NaN              NaN
735       NaN     NaN              NaN        NaN        NaN              NaN
1433      NaN     NaN              NaN        NaN        NaN              NaN
1553      NaN     NaN              NaN        NaN        NaN              NaN

In [11]:
data=data.dropna(how='all')

In [12]:
na_data=data[data.isna().any(axis=1)]

In [13]:
data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
5,176561,Wired Headphones,1,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001"

In [14]:
data['Order Date']

0        04/19/19 08:46
2        04/07/19 22:30
3        04/12/19 14:38
4        04/12/19 14:38
5        04/30/19 09:27
              ...
11681    09/17/19 20:56
11682    09/01/19 16:00
11683    09/23/19 07:39
11684    09/19/19 17:30
11685    09/30/19 00:18
Name: Order Date, Length: 186305, dtype: object

In [15]:
data=data[data['Order Date'].str[0:2]!='Or']

In [ ]:
data['Order Date']=data['Order Date'].map(pd.to_datetime)

In [ ]:
data['Order Date']

###### convert column of correct type

In [ ]:
data.head()

In [ ]:
data['Quantity Ordered']=pd.to_numeric(data['Quantity Ordered'])

In [ ]:
data['Price Each']=pd.to_numeric(data['Price Each'])

### Add a Sales column into Dataframe/

In [ ]:
data['Sales']=data['Quantity Ordered']*data['Price Each']

In [ ]:
data.head()

In [ ]:
data['Order Date'].head()

In [ ]:
def get_month(data):
    return data.month
data['Month']=data['Order Date'].map(get_month)

In [ ]:
result=data.groupby('Month').sum()

result

## plot bar between month  and sales

In [ ]:
month=range(1,13)
plt.bar(month,result['Sales'])
plt.plot()
plt.ylabel('Sales in Us')
plt.xlabel('Month')

## Add a city column

In [ ]:
data.head()

In [ ]:
def column(x):
    return x.split(',')[1]
def city(x):
    return x.split(',')[2].split(' ')[1]

In [ ]:
data['City']=data['Purchase Address'].apply(lambda x:column(x)+'('+city(x)+')')

In [ ]:
data.head()

In [ ]:
result=data.groupby('City').sum()
result

In [ ]:
cities=data['City'].unique()

In [ ]:
cities

In [ ]:
plt.bar(cities,result['Sales'])
plt.xticks(cities,rotation='vertical',size=7)

### What time should we display advertisements to maximize likelihood of customer's buying product?

In [ ]:
data.head()

In [ ]:
def hour(x):
    return x.hour
def min(x):
    return x.minute
data['Hour']=data['Order Date'].map(hour)
data['Min']=data['Order Date'].map(min)

In [ ]:
data.head()

In [ ]:
hours=[h for h,j in data.groupby('Hour')]

In [ ]:
plt.plot(hours,data.groupby('Hour').count())
plt.grid()
plt.xticks(hours)
plt.xlabel('hours')
plt.ylabel('no of orders')
plt.show()

### what products are most often sold together ?

In [ ]:
data.head(10)

In [ ]:
g=data.groupby('Product')

In [ ]:
for i ,j in g:
    print(i)
    print(len(g))